app/views/visitors/_im_bored_form.html.erb

	<%= f.label :groups, "Groups to notify:" %> </br>
	<% if user.groups.all.size > 0 %>
---
SELECT "groups".* FROM "groups" INNER JOIN "users_groups" ON "groups"."id" = "users_groups"."group_id" WHERE "users_groups"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "groups" INNER JOIN "users_groups" ON "groups"."id" = "users_groups"."group_id" WHERE "users_groups"."user_id" = ?  [["user_id", 1]]