app/views/groups/_group.html.erb

				<div>
					<% if group.users.size > 0 %>
						<%= group.users.map(&:name).first(3).join(",") %>
---
SELECT "users".* FROM "users" INNER JOIN "users_groups" ON "users"."id" = "users_groups"."user_id" WHERE "users_groups"."group_id" = ?  [["group_id", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "users_groups" ON "users"."id" = "users_groups"."user_id" WHERE "users_groups"."group_id" = ?  [["group_id", 3]]
SELECT  "users".* FROM "users" INNER JOIN "users_groups" ON "users"."id" = "users_groups"."user_id" WHERE "users_groups"."group_id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["group_id", 1], ["LIMIT", 3]]