app/views/groups/_group_button.html.erb

SELECT  1 AS one FROM "users" INNER JOIN "users_groups" ON "users"."id" = "users_groups"."user_id" WHERE "users_groups"."group_id" = ? AND "users"."id" = ? LIMIT ?  [["group_id", 1], ["id", 1], ["LIMIT", 1]]
---
<% if not group.users.include? current_user %>