app/views/events/index.html.erb

    <b>Attendees: </b><br>
        <% event.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "users_events" ON "users"."id" = "users_events"."user_id" WHERE "users_events"."event_id" = ?  [["event_id", 1]]