app/controllers/events_controller.rb

  def create
      @event = Event.new(event_params)
      if @event.save
---
INSERT INTO "events" ("name", "description", "month", "day", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Pizza Party"], ["description", ""], ["month", "January"], ["day", 1], ["year", 2017], ["created_at", 2016-11-14 04:30:59 UTC], ["updated_at", 2016-11-14 04:30:59 UTC]]

  def join
      event = Event.find(params[:event_id])
      if not event.users.include? current_user
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "users_events" ON "users"."id" = "users_events"."user_id" WHERE "users_events"."event_id" = ? AND "users"."id" = ? LIMIT ?  [["event_id", 1], ["id", 1], ["LIMIT", 1]]