app/controllers/groups_controller.rb

	def index
		if current_user.nil?
			flash[:error] = "You must be logged in to see groups."
			redirect_to "/users/sign_in"
		else
			@groups = Group.all
---
SELECT "groups".* FROM "groups"

	def create
		if current_user
			group = Group.new(group_params.merge(:leader => current_user))
			if group.save
---
INSERT INTO "groups" ("name", "description", "created_at", "updated_at", "leader_id") VALUES (?, ?, ?, ?, ?)  [["name", "sup"], ["description", "hey"], ["created_at", 2016-11-29 06:37:18 UTC], ["updated_at", 2016-11-29 06:37:18 UTC], ["leader_id", 1]]

	def join
		group = Group.find(params[:id])
		if current_user
			if not group.users.include? current_user
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "users_groups" ON "users"."id" = "users_groups"."user_id" WHERE "users_groups"."group_id" = ? AND "users"."id" = ? LIMIT ?  [["group_id", 1], ["id", 1], ["LIMIT", 1]]

	def leave
		group = Group.find(params[:id])
		if current_user
			if group.users.include? current_user
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "users_groups" ON "users"."id" = "users_groups"."user_id" WHERE "users_groups"."group_id" = ? AND "users"."id" = ? LIMIT ?  [["group_id", 1], ["id", 1], ["LIMIT", 1]]