app/controllers/things_to_dos_controller.rb

SELECT "things_to_dos".* FROM "things_to_dos"
---
    def index
        @thingstodos = ThingsToDo.new
        @things = ThingsToDo.all

INSERT INTO "users_things_to_dos" ("user_id", "things_to_do_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["things_to_do_id", 5], ["created_at", 2016-11-29 07:40:14 UTC], ["updated_at", 2016-11-29 07:40:14 UTC]]
---
    def create
        @thingstodos = ThingsToDo.new(thingstodos_params)
        if @thingstodos.save