app/controllers/visitors_controller.rb

	def bored_update
		notification = Notification.new(bored_params.merge(:creator => current_user.name))
		if notification.save
			users = Set.new
			groups = params[:group][:groups]

			if !groups.nil?
				groups.drop(1).each do |group_id|
					group = Group.find(group_id)
					users.merge(group.users.all)
---
INSERT INTO "notifications" ("description", "created_at", "updated_at", "creator") VALUES (?, ?, ?, ?)  [["description", "Drink"], ["created_at", 2016-11-29 07:52:47 UTC], ["updated_at", 2016-11-29 07:52:47 UTC], ["creator", "Ashley"]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "users_groups" ON "users"."id" = "users_groups"."user_id" WHERE "users_groups"."group_id" = ?  [["group_id", 2]]